backend/app/controllers/api/v1/employees_controller.rb

      def index
        employees = Employee.all
        employees = employees.by_country(params[:country])                        if params[:country].present?
        employees = employees.by_job_title(params[:job_title])                    if params[:job_title].present?
        employees = employees.by_department(params[:department])                  if params[:department].present?
        employees = employees.where(employment_type: params[:employment_type])    if params[:employment_type].present?
        employees = employees.where("LOWER(full_name) LIKE ?", "%#{params[:search].downcase}%") if params[:search].present?

        employees = employees.order(:full_name).page(params[:page]).per(params[:per_page] || 25)
---
SELECT COUNT(*) FROM "employees" WHERE (LOWER(full_name) LIKE '%m%')
SELECT COUNT(*) FROM "employees" WHERE "employees"."employment_type" = $1  [["employment_type", "full_time"]]
SELECT "employees".* FROM "employees" WHERE (LOWER(full_name) LIKE '%m%') ORDER BY id asc LIMIT $1 OFFSET $2  [["LIMIT", 25], ["OFFSET", 0]]

      def create
        employee = Employee.new(employee_params)
        if employee.save
---
INSERT INTO "employees" ("full_name", "job_title", "department", "country", "salary", "currency", "employment_type", "email", "hired_on", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"

      def update
        if @employee.update(employee_params)
---
UPDATE "employees" SET "currency" = $1, "updated_at" = $2 WHERE "employees"."id" = $3  [["currency", "INR"], ["updated_at", "2026-05-09 12:05:49.110642"], ["id", 10122]]

      def destroy
        @employee.destroy
---
DELETE FROM "employees" WHERE "employees"."id" = $1  [["id", 155]]