backend/app/controllers/api/v1/employees_controller.rb

SELECT "employees".* FROM "employees" ORDER BY id asc LIMIT $1 OFFSET $2  [["LIMIT", 25], ["OFFSET", 0]]
---
      def index
        employees = Employee.filter(filter_params)
                            .sorted(params[:sort], params[:direction])
                            .page(params[:page])
                            .per(params[:per_page] || 25)