backend/app/queries/insights_query.rb

  def self.countries
    Employee.distinct.order(:country).pluck(:country)
---
SELECT DISTINCT "employees"."country" FROM "employees" ORDER BY "employees"."country" ASC